//WTOPGASM   JOB 1,NOTIFY=&SYSUID,MSGLEVEL=(1,1)
//ASM      EXEC ASMACL,MBR=WTOPGM
//C.SYSIN  DD  DSN=&SYSUID..WTO.SOURCE(WTOPGM),DISP=SHR
//SYSLMOD  DD  DSN=&SYSUID..LOAD,DISP=SHR
